Revit 2027 API
FamilyManager.AssociateElementParameterToFamilyParameter Method
Associates or disassociates the element parameter to an existing family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AssociateElementParameterToFamilyParameter(
	Parameter elementParameter,
	FamilyParameter familyParameter
)
Public Sub AssociateElementParameterToFamilyParameter (
	elementParameter As Parameter,
	familyParameter As FamilyParameter
)
public:
void AssociateElementParameterToFamilyParameter(
	Parameter^ elementParameter,
	FamilyParameter^ familyParameter
)
member AssociateElementParameterToFamilyParameter :
        elementParameter : Parameter *
        familyParameter : FamilyParameter -> unit
Parameters
elementParameter Parameter
The parameter of an element in family.
familyParameter FamilyParameter
The existing family parameter. If the input to this argument is null, it will disassociate the element parameter from any family parameters.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"elementParameter"-is null.
ArgumentException |  Thrown when the input argument-"elementParameter" or "familyParameter"-is an invalid parameter, or the input argument-"elementParameter"-cannot be associated.
InvalidOperationException |  Thrown when the family parameter binding failed.
Remarks
The parameter types of these two input parameter should be same, if not an exception with failure information will be thrown.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace